HEUR-Trojan/MSIL/G/HEUR-Trojan.MSIL.Gorgon.gen-bf535869266eca7a958714acade2ede1bff0e73f0aaa2702f389ededee6a8d6a/JVxpvyzMJxQlR/SFnNLqBzQzOfq.cs

// Decompiled with JetBrains decompiler
// Type: JVxpvyzMJxQlR.SFnNLqBzQzOfq
// Assembly: Udby4Jt48oXkJ, Version=3.17.2.31, Culture=neutral, PublicKeyToken=b03f5f7f11d50a3a
// MVID: 37899E89-D673-4F5B-A193-2E4DF6A54096
// Assembly location: C:\Users\Administrateur\Downloads\Bazaar.2022.03\HEUR-Trojan.MSIL.Gorgon.gen-bf535869266eca7a958714acade2ede1bff0e73f0aaa2702f389ededee6a8d6a.exe

using \u0036mHL90hQ651VX;
using fl1AlRxD2wuQJ;
using gjPCmt0NG5r0s;
using LW05ej0BDcVEz;
using mhZ8amQVr4JAO;
using qCZWYBioj9oGa;
using qU6okXWnajUcG;
using SB5vAwNIA2oOZ;
using System;
using System.Globalization;
using System.Runtime.CompilerServices;
using System.Text;
using System.Threading.Tasks;
using TlfuIkkM6v6pC;

namespace JVxpvyzMJxQlR
{
  internal static class SFnNLqBzQzOfq
  {
    private const int zKHRwjKZ8tepF = 1024;
    private const string GMOve3adQ6CXF = "<s:Envelope xmlns:s='http://www.w3.org/2003/05/soap-envelope' xmlns:a='http://www.w3.org/2005/08/addressing' xmlns:u='{0}'>\r\n              <s:Header>\r\n              <a:Action s:mustUnderstand='1'>{1}</a:Action>\r\n              <a:MessageID>urn:uuid:{2}</a:MessageID>\r\n              <a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo>\r\n              <a:To s:mustUnderstand='1'>{3}</a:To>\r\n              {4}\r\n              </s:Header>\r\n              <s:Body>\r\n              <trust:RequestSecurityToken xmlns:trust='{5}'>\r\n              <wsp:AppliesTo xmlns:wsp='http://schemas.xmlsoap.org/ws/2004/09/policy'>\r\n              <a:EndpointReference>\r\n              <a:Address>{6}</a:Address>\r\n              </a:EndpointReference>\r\n              </wsp:AppliesTo>\r\n              <trust:KeyType>{7}</trust:KeyType>\r\n              <trust:RequestType>{8}</trust:RequestType>\r\n              </trust:RequestSecurityToken>\r\n              </s:Body>\r\n              </s:Envelope>";
    private const string jEyv4JGmMDrL0 = "urn:federation:MicrosoftOnline";

    public static Task<j4jA7grxHZiOZ> L3SF95VmatSau(
      ASnJckF0HsK8S _param0,
      wvvZ5em0NCA6X _param1,
      Up2ciG6wVdM5T yfr3xTk35t7wZ,
      string QcYwNvQtmrlMX)
    {
      // ISSUE: variable of a compiler-generated type
      SFnNLqBzQzOfq.axvMdqSiXzjkd stateMachine;
      // ISSUE: reference to a compiler-generated field
      stateMachine.\u0032tCT6k6GUaA1M = _param0;
      // ISSUE: reference to a compiler-generated field
      stateMachine.IPvv8tHra3idk = _param1;
      // ISSUE: reference to a compiler-generated field
      stateMachine.\u0030ZefiYk4Jw24O = yfr3xTk35t7wZ;
      // ISSUE: reference to a compiler-generated field
      stateMachine.XGkS28kzI9L5V = QcYwNvQtmrlMX;
      // ISSUE: reference to a compiler-generated field
      stateMachine.BBAf7M6HEbk93 = AsyncTaskMethodBuilder<j4jA7grxHZiOZ>.Create();
      // ISSUE: cast to a reference type
      // ISSUE: explicit reference operation
      // ISSUE: reference to a compiler-generated field
      (^(k6gTrIxOBrD7n.suiYjOGPtymB3&) ref stateMachine).W5LsMluEQpplB = -1;
      // ISSUE: reference to a compiler-generated field
      stateMachine.BBAf7M6HEbk93.Start<SFnNLqBzQzOfq.axvMdqSiXzjkd>(ref stateMachine);
      // ISSUE: reference to a compiler-generated field
      return stateMachine.BBAf7M6HEbk93.Task;
    }

    private static void Tr4sjCG7ZzOw2(IHttpClient TOxS6v0BMahXc) => TOxS6v0BMahXc.UseDefaultCredentials = true;

    public static StringBuilder \u003463pXZ0JRVoSJ(
      string LX11ZWB8AuBnY,
      ASnJckF0HsK8S rVDj72BTcQy8F,
      wvvZ5em0NCA6X a2epmqMBuQQZs)
    {
      StringBuilder UCF2WEihYYizc = SFnNLqBzQzOfq.nSFw42p1sd9Jr(a2epmqMBuQQZs);
      string str1 = Guid.NewGuid().ToString();
      StringBuilder stringBuilder = new StringBuilder(1024);
      string str2 = "http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd";
      string str3 = "http://docs.oasis-open.org/ws-sx/ws-trust/200512/RST/Issue";
      string str4 = "http://docs.oasis-open.org/ws-sx/ws-trust/200512";
      string str5 = "http://docs.oasis-open.org/ws-sx/ws-trust/200512/Bearer";
      string str6 = "http://docs.oasis-open.org/ws-sx/ws-trust/200512/Issue";
      if (rVDj72BTcQy8F.\u00323uKu3mcukpJn == n6TGt2r3FxEvZ.WsTrust2005)
      {
        str3 = "http://schemas.xmlsoap.org/ws/2005/02/trust/RST/Issue";
        str4 = "http://schemas.xmlsoap.org/ws/2005/02/trust";
        str5 = "http://schemas.xmlsoap.org/ws/2005/05/identity/NoProofKey";
        str6 = "http://schemas.xmlsoap.org/ws/2005/02/trust/Issue";
      }
      stringBuilder.AppendFormat((IFormatProvider) CultureInfo.CurrentCulture, "<s:Envelope xmlns:s='http://www.w3.org/2003/05/soap-envelope' xmlns:a='http://www.w3.org/2005/08/addressing' xmlns:u='{0}'>\r\n              <s:Header>\r\n              <a:Action s:mustUnderstand='1'>{1}</a:Action>\r\n              <a:MessageID>urn:uuid:{2}</a:MessageID>\r\n              <a:ReplyTo><a:Address>http://www.w3.org/2005/08/addressing/anonymous</a:Address></a:ReplyTo>\r\n              <a:To s:mustUnderstand='1'>{3}</a:To>\r\n              {4}\r\n              </s:Header>\r\n              <s:Body>\r\n              <trust:RequestSecurityToken xmlns:trust='{5}'>\r\n              <wsp:AppliesTo xmlns:wsp='http://schemas.xmlsoap.org/ws/2004/09/policy'>\r\n              <a:EndpointReference>\r\n              <a:Address>{6}</a:Address>\r\n              </a:EndpointReference>\r\n              </wsp:AppliesTo>\r\n              <trust:KeyType>{7}</trust:KeyType>\r\n              <trust:RequestType>{8}</trust:RequestType>\r\n              </trust:RequestSecurityToken>\r\n              </s:Body>\r\n              </s:Envelope>", (object) str2, (object) str3, (object) str1, (object) rVDj72BTcQy8F.\u0036ioCCPFiQWZmV, (object) UCF2WEihYYizc, (object) str4, (object) LX11ZWB8AuBnY, (object) str5, (object) str6);
      UCF2WEihYYizc.N0DBWL52gqHAp();
      return stringBuilder;
    }

    internal static string \u0031hMOr5Cqu30xK(string CJwzeThqJEAud)
    {
      CJwzeThqJEAud = CJwzeThqJEAud.Replace("&", "&amp;");
      CJwzeThqJEAud = CJwzeThqJEAud.Replace("\"", "&quot;");
      CJwzeThqJEAud = CJwzeThqJEAud.Replace("'", "&apos;");
      CJwzeThqJEAud = CJwzeThqJEAud.Replace("<", "&lt;");
      CJwzeThqJEAud = CJwzeThqJEAud.Replace(">", "&gt;");
      return CJwzeThqJEAud;
    }

    private static StringBuilder nSFw42p1sd9Jr(wvvZ5em0NCA6X _param0)
    {
      StringBuilder stringBuilder = new StringBuilder(1024);
      if (_param0.\u00331g4lZNzQ9jaw == qAJfDhShCBvqg.UsernamePassword)
      {
        StringBuilder UCF2WEihYYizc = new StringBuilder(1024);
        string str1 = Guid.NewGuid().ToString();
        UCF2WEihYYizc.AppendFormat((IFormatProvider) CultureInfo.CurrentCulture, "<o:UsernameToken u:Id='uuid-{0}'><o:Username>{1}</o:Username><o:Password>", new object[2]
        {
          (object) str1,
          (object) _param0.C4zHQTLCFu0sH
        });
        char[] fz3djBZhVXby5 = (char[]) null;
        try
        {
          fz3djBZhVXby5 = _param0.GMtwvyfDr4rBV();
          string str2 = SFnNLqBzQzOfq.\u0031hMOr5Cqu30xK(new string(fz3djBZhVXby5));
          UCF2WEihYYizc.Append(str2);
        }
        finally
        {
          fz3djBZhVXby5.Q58NcIDIIIOlr();
        }
        UCF2WEihYYizc.Append("</o:Password></o:UsernameToken>");
        DateTime utcNow = DateTime.UtcNow;
        string str3 = SFnNLqBzQzOfq.NDnOuEPDMJfM5(utcNow);
        string str4 = SFnNLqBzQzOfq.NDnOuEPDMJfM5(utcNow.AddMinutes(10.0));
        stringBuilder.AppendFormat((IFormatProvider) CultureInfo.CurrentCulture, "<o:Security s:mustUnderstand='1' xmlns:o='http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd'><u:Timestamp u:Id='_0'><u:Created>{0}</u:Created><u:Expires>{1}</u:Expires></u:Timestamp>{2}</o:Security>", new object[3]
        {
          (object) str3,
          (object) str4,
          (object) UCF2WEihYYizc
        });
        UCF2WEihYYizc.N0DBWL52gqHAp();
      }
      return stringBuilder;
    }

    private static string NDnOuEPDMJfM5(DateTime _param0) => _param0.ToString("yyyy-MM-ddTHH:mm:ss.068Z", (IFormatProvider) CultureInfo.InvariantCulture);
  }
}
